
#Найдите сумму цифр трехзначного числа

#num = input("Введите трехзначное число")
#num1 = int(num[0])
#num2 = int(num[1])
#num3 = int(num[2])
#if len(num) > 3:
    #print("Введено не трехзначное число")
#print(num1 + num2 + num3)

#Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
#Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа 
#сделали одинаковое количество журавликов, 
#а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

#s = int(input("Введите сумму сделанных журавликов"))
#print (s/6 , "Журавликов сделал Петя")
#print (s/6 , "Журавликов сделал Коля")
#print (2*s/6 + 2*s/6 , "Журавликов сделала Катя")

#Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
#Вам требуется написать программу, которая проверяет счастливость билета.

#num = input("введите номер билета")
#num1 = int(num[0])
#num2 = int(num[1])
#num3 = int(num[2])
#num4 = int(num[3])
#num5 = int(num[4])
#num6 = int(num[5])
#if num1 + num2 + num3 == num4 + num5 + num6:
    #print("билет счастливый")
#else: 
    #print("билет несчастливый")

#Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
#если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
#Пример:
#3 2 4 -> yes
#3 2 1 -> no'''
#n = input("Введите длину первой стороны")
#m = input("Введите длину второй стороны")
#k = input("Введите количество долек")
#if int(k) % int(n) == 0 or int(k) % int(m) == 0:
    #print('Yes')
#else: 
    #print('No')





